const gulp = require("gulp");
const render = require("gulp-nunjucks-render");
const rename = require("gulp-rename");

const src = `${__dirname}/src`;
const dist = `${__dirname}/docs`;

const factions = [
  { 
    name: "comintern", 
    description: ` Коминтерн - доктрина, в список стран которых входят страны с
коммунистической идеологией на момент начала Второй Мировой Войны в 1939
году, такие как СССР, Югославия, Синьцзань и так далее. Доктрина
Коминтерн разбросана по всем материкам, начиная от Азии и заканчивая
Южной Америкой.`,
    countries: [
      {
        name: "СССР",
        link: "СССР.html",
      },
      {
        name: "Югославия",
        link: "Югославия.html",
      },
      {
        name: "Синьцзань",
        link: "Синьцзань.html",
      },
      {
        name: "Монголия",
        link: "Монголия.html",
      },
      {
        name: "Венесуэла",
        link: "Венесуэла.html",
      },
    ],
  }, 
  { 
    name: "axis", 
    description: `Ось - доктрина в список стран которой входят государства с фашистким,
 нацистким и прогерманским устройством государства, такие как Германский Рейх, 
 Королевство Италия и так далее. Ось - является сильнейшей доктриной на всех континентах Земли.`, 
    countries: [
      {
        name: "Третий Рейх",
        link: "Третий Рейх.html",
      },
      {
        name: "Испания",
        link: "Испания.html",
      },
      {
        name: "Румыния",
        link: "Румыния.html",
      },
      {
        name: "Персия",
        link: "Персия.html",
      },
      {
        name: "Аргентина",
        link: "Аргентина.html",
      },
      {
        name: "Перу",
        link: "Перу.html",
      },
    ],
  },
  { 
    name: "allies", 
    description: `Союзника - доктрина, в список стран которой входят страны с
    демократическим государственным устройством на момент начала Второй
    Мировой Войны, например такие страны как Великобритания, США, Франция и
    так далее. Союзники являются главным противовесом Германскому Рейху и ее
    коалиции - Ось. Доктрине Союзники принадлежат больше 50% территорий
    карты.`, 
    countries: [
      {
        name: "ВБ",
        link: "ВБ.html",
      },
      {
        name: "Франция",
        link: "Франция.html",
      },
      {
        name: "США",
        link: "США.html",
      },
      {
        name: "Швеция",
        link: "Швеция.html",
      },
      {
        name: "Польша",
        link: "Польша.html",
      },
      {
        name: "Канада",
        link: "Канада.html",
      },
      {
        name: "Индия",
        link: "Индия.html",
      },
      {
        name: "Австралия",
        link: "Австралия.html",
      },
      {
        name: "Мексика",
        link: "Мексика.html",
      },
      {
        name: "Египет",
        link: "Египет.html",
      },
      {
        name: "Нидерланды",
        link: "Нидерланды.html",
      },
      {
        name: "ЮАР",
        link: "ЮАР.html",
      },
      {
        name: "Бразилия",
        link: "Бразилия.html",
      },
    ],
  },
  { 
    name: "axis", 
    description: `Коминтерн - доктрина, в список стран которых входят страны с
    коммунистической идеологией на момент начала Второй Мировой Войны в 1939
    году, такие как СССР, Югославия, Синьцзань и так далее. Доктрина
    Коминтерн разбросана по всем материкам, начиная от Азии и заканчивая
    Южной Америкой.`, 
    countries: [
      {
        name: "СССР",
        link: "СССР.html",
      },
      {
        name: "Монголия",
        link: "Монголия.html",
      },
      {
        name: "Югославия",
        link: "Югославия.html",
      },
      {
        name: "Синьцзань",
        link: "Синьцзань.html",
      },
      {
        name: "Венесуэла",
        link: "Венесуэла.html",
      },
    ],
  }
]; 

gulp.task("render", function (done) {
  gulp
    .src(`${src}/templates/index.njk`)
    .pipe(
      render({
        path: [`${src}/templates/`],
      })
    )
    .pipe(gulp.dest(dist));

  factions.forEach((faction) => {
    gulp
      .src(`${src}/templates/faction.njk`)
      .pipe(
        render({
          path: [`${src}/templates/`],
          data: { faction },
        })
      )
      .pipe(rename(`${faction.name}.html`))
      .pipe(gulp.dest(dist));
  });

  done();
});
